In [1]:
import pandas as pd

In [2]:
data = {
    "Name" : ["Alice", "Bob", "Charlie", "David", "Eva", "Frank", "Grace", "Hannah", "Ian"],
    "Age" : [25, 30, 35, 45, 28, 40, 30, 25, 50],
    "Salary" : [50000, 300000, 400000, 500000, 85000, 600000, 300000, 52000, 600000],
    "City" : ["New York", "Los Angeles", "Chicago", "Houston", "Phoenix", "Philadelphia", "San Antonio", "San Diego", "Dallas"],
    "Weight" : [130, 180, 175, 200, 140, 190, 160, 135, 210],
    "Loan Status": ["Denied", "Denied", "Approved", "Approved", "Denied", "Approved", "Denied", "Denied", "Denied"]
}

df = pd.DataFrame(data)
df

      Name  Age  Salary          City  Weight Loan Status
0    Alice   25   50000      New York     130      Denied
1      Bob   30  300000   Los Angeles     180      Denied
2  Charlie   35  400000       Chicago     175    Approved
3    David   45  500000       Houston     200    Approved
4      Eva   28   85000       Phoenix     140      Denied
5    Frank   40  600000  Philadelphia     190    Approved
6    Grace   30  300000   San Antonio     160      Denied
7   Hannah   25   52000     San Diego     135      Denied
8      Ian   50  600000        Dallas     210      Denied

In [3]:
df["Loan Status"] = (df["Loan Status"] == "Approved").astype(int)
df

      Name  Age  Salary          City  Weight  Loan Status
0    Alice   25   50000      New York     130            0
1      Bob   30  300000   Los Angeles     180            0
2  Charlie   35  400000       Chicago     175            1
3    David   45  500000       Houston     200            1
4      Eva   28   85000       Phoenix     140            0
5    Frank   40  600000  Philadelphia     190            1
6    Grace   30  300000   San Antonio     160            0
7   Hannah   25   52000     San Diego     135            0
8      Ian   50  600000        Dallas     210            0

In [6]:
df.corr(numeric_only=True)

                  Age    Salary    Weight  Loan Status
Age          1.000000  0.916070  0.930558     0.483141
Salary       0.916070  1.000000  0.957260     0.603896
Weight       0.930558  0.957260  1.000000     0.498780
Loan Status  0.483141  0.603896  0.498780     1.000000

In [9]:
correlation = df.corr(numeric_only = True)["Loan Status"]
correlation

Age            0.483141
Salary         0.603896
Weight         0.498780
Loan Status    1.000000
Name: Loan Status, dtype: float64

In [10]:
correlation = correlation.abs()
correlation

Age            0.483141
Salary         0.603896
Weight         0.498780
Loan Status    1.000000
Name: Loan Status, dtype: float64

In [11]:
sorted_features = correlation.sort_values(ascending = False)
sorted_features

Loan Status    1.000000
Salary         0.603896
Weight         0.498780
Age            0.483141
Name: Loan Status, dtype: float64